app/views/messages/_side_bar.html.erb

SELECT `rooms`.* FROM `rooms` INNER JOIN `room_users` ON `rooms`.`id` = `room_users`.`room_id` WHERE `room_users`.`user_id` = 2
---
<div class="rooms">
  <% current_user.rooms.each do |room| %>