app/controllers/messages_controller.rb

  def index
    @message = Message.new
    @room = Room.find(params[:room_id])
---
SELECT `rooms`.* FROM `rooms` WHERE `rooms`.`id` = 1 LIMIT 1

  def create
    @room = Room.find(params[:room_id])
    @message = @room.messages.new(message_params)
    if @message.save
---
SELECT `rooms`.* FROM `rooms` WHERE `rooms`.`id` = 4 LIMIT 1
INSERT INTO `messages` (`content`, `room_id`, `user_id`, `created_at`, `updated_at`) VALUES ('', 4, 2, '2021-03-17 12:46:13.008236', '2021-03-17 12:46:13.008236')