app/controllers/rooms_controller.rb

  def create
    @room = Room.new(room_params)
    if @room.save
---
INSERT INTO `rooms` (`name`, `created_at`, `updated_at`) VALUES ('新規チャット2', '2021-03-17 08:55:42.438407', '2021-03-17 08:55:42.438407')

  def destroy
    room = Room.find(params[:id])
    room.destroy
---
SELECT `rooms`.* FROM `rooms` WHERE `rooms`.`id` = 2 LIMIT 1
DELETE FROM `rooms` WHERE `rooms`.`id` = 2